{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,72],"dtype":"float32"}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.9,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"Activation","config":{"activation":"relu","name":"activation_Activation1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.9,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"Activation","config":{"activation":"relu","name":"activation_Activation2","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.9,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"Activation","config":{"activation":"relu","name":"activation_Activation3","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.9,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true}},{"class_name":"Activation","config":{"activation":"relu","name":"activation_Activation4","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.9,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true}},{"class_name":"Activation","config":{"activation":"relu","name":"activation_Activation5","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true}},{"class_name":"Dense","config":{"units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[72,64],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[32,5],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[32],"dtype":"float32"}]}],"format":"tfjs-layers","generatedBy":"lamination-export","convertedAt":"2026-06-13T11:04:04.939Z"}